# Polish Register Of Economic Units

## Introduction

The function `clean_pl_regon()` cleans a column containing Polish register of economic units (REGON) strings, and standardizes them in a given format. The function `validate_pl_regon()` validates either a single REGON strings, a column of REGON strings or a DataFrame of REGON strings, returning `True` if the value is valid, and `False` otherwise.

REGON strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "192598184"
* `standard`: REGON strings with proper whitespace in the proper places. Note that in the case of REGON, the compact format is the same as the standard one.

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_pl_regon()` and `validate_pl_regon()`.

### An example dataset containing REGON strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "regon": [
            '192598184',
            '192598183',
            'BE 428759497',
            'BE431150351',
            "002 724 334",
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

          regon                                           address
0     192598184                                     123 Pine Ave.
1     192598183                                           main st
2  BE 428759497                      1234 west main heights 57033
3   BE431150351                    apt 1 789 s maple rd manhattan
4   002 724 334                robie house, 789 north main street
5         hello         1111 S Figueroa St, Los Angeles, CA 90015
6           NaN  (staples center) 1111 S Figueroa St, Los Angeles
7          NULL                                             hello

## 1. Default `clean_pl_regon`

By default, `clean_pl_regon` will clean regon strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_pl_regon
clean_pl_regon(df, column = "regon")

          regon                                           address regon_clean
0     192598184                                     123 Pine Ave.   192598184
1     192598183                                           main st         NaN
2  BE 428759497                      1234 west main heights 57033         NaN
3   BE431150351                    apt 1 789 s maple rd manhattan         NaN
4   002 724 334                robie house, 789 north main street   002724334
5         hello         1111 S Figueroa St, Los Angeles, CA 90015         NaN
6           NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7          NULL                                             hello         NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_pl_regon(df, column = "regon", output_format="standard")

          regon                                           address regon_clean
0     192598184                                     123 Pine Ave.   192598184
1     192598183                                           main st         NaN
2  BE 428759497                      1234 west main heights 57033         NaN
3   BE431150351                    apt 1 789 s maple rd manhattan         NaN
4   002 724 334                robie house, 789 north main street   002724334
5         hello         1111 S Figueroa St, Los Angeles, CA 90015         NaN
6           NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7          NULL                                             hello         NaN

### `compact`

In [4]:
clean_pl_regon(df, column = "regon", output_format="compact")

          regon                                           address regon_clean
0     192598184                                     123 Pine Ave.   192598184
1     192598183                                           main st         NaN
2  BE 428759497                      1234 west main heights 57033         NaN
3   BE431150351                    apt 1 789 s maple rd manhattan         NaN
4   002 724 334                robie house, 789 north main street   002724334
5         hello         1111 S Figueroa St, Los Angeles, CA 90015         NaN
6           NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7          NULL                                             hello         NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned REGON strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_pl_regon(df, column="regon", inplace=True)

  regon_clean                                           address
0   192598184                                     123 Pine Ave.
1         NaN                                           main st
2         NaN                      1234 west main heights 57033
3         NaN                    apt 1 789 s maple rd manhattan
4   002724334                robie house, 789 north main street
5         NaN         1111 S Figueroa St, Los Angeles, CA 90015
6         NaN  (staples center) 1111 S Figueroa St, Los Angeles
7         NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_pl_regon(df, "regon", errors="coerce")

          regon                                           address regon_clean
0     192598184                                     123 Pine Ave.   192598184
1     192598183                                           main st         NaN
2  BE 428759497                      1234 west main heights 57033         NaN
3   BE431150351                    apt 1 789 s maple rd manhattan         NaN
4   002 724 334                robie house, 789 north main street   002724334
5         hello         1111 S Figueroa St, Los Angeles, CA 90015         NaN
6           NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7          NULL                                             hello         NaN

### `ignore`

In [7]:
clean_pl_regon(df, "regon", errors="ignore")

,regon,address,regon_clean
0,192598184,123 Pine Ave.,192598184
1,192598183,main st,192598183
2,BE 428759497,1234 west main heights 57033,BE 428759497
3,BE431150351,apt 1 789 s maple rd manhattan,BE431150351
4,002 724 334,"robie house, 789 north main street",002724334
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",hello
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 4. `validate_pl_regon()`

`validate_pl_regon()` returns `True` when the input is a valid REGON. Otherwise it returns `False`.

The input of `validate_pl_regon()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_pl_regon()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_pl_regon()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_pl_regon
print(validate_pl_regon("192598184"))
print(validate_pl_regon("192598183"))
print(validate_pl_regon('BE 428759497'))
print(validate_pl_regon('BE431150351'))
print(validate_pl_regon("004085616"))
print(validate_pl_regon("hello"))
print(validate_pl_regon(np.nan))
print(validate_pl_regon("NULL"))

True
False
False
False
False
False
False
False

### Series

In [9]:
validate_pl_regon(df["regon"])

0     True
1    False
2    False
3    False
4     True
5    False
6    False
7    False
Name: regon, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_pl_regon(df, column="regon")

0     True
1    False
2    False
3    False
4     True
5    False
6    False
7    False
Name: regon, dtype: bool

### Only DataFrame

In [11]:
validate_pl_regon(df)

   regon  address
0   True    False
1  False    False
2  False    False
3  False    False
4   True    False
5  False    False
6  False    False
7  False    False